Mermaid md for diagrams
